package homework_1;

    public class Main {
        public static void main(String[] args) {
//            1)

            String[] cities = {"Москва", "Казань", "Сочи", "Владивосток"};

            for (int i = 0; i < cities.length; i = i + 1) {
                System.out.println(cities[i]);
            }

//            2)

            System.out.print("Я изучаю Java!");
            System.out.println("Я изучаю Java!");
            System.out.printf("Я изучаю Java!");

//            3)

//            Язык программирования это специальный компьютерный язык, при помощи которого профессионалы своего дела
//            (программисты) создают программы. Например, для телефона --- мессенджер, а для компьютера игры, требующие места.
//            Один из таких языков --- язык программирования Java. На Java можно создавать крупные, высокопроизводительные и масштабируемые проекты.

//            4)

//            В первую очередь, файл должен называться так, как мы будем вызывать и нельзя менять название файла во время работы с проектом.
//            Компилятор превращает код написанный создателем в машинный код.
//            Jvm (Java Virtual Machine) запускает и выполняет байт-код.

//            5)

//            Java является одним из самых популярных языков программирования в банковской промышленности.
//            Майнкрафт был создан на Java.
//            Netflix также был разработан на Java.

//            6)
//            Рецепт блюда человек просматривает и при надобности готовит еду.
//            Также разработчик пишет код и запускает его.
         }
    }

